---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.IDuctPressureDropServer
source: html/4c6b9e30-d792-c630-15ed-ef9e394e4a03.htm
---
# IDuctPressureDropServer Methods

Calculate the duct pressure drop.